pepa667/bebopCORE/bebopCORE/sdkconfig.defaults
# bebopCORE baseline defaults (ESP-IDF 5.5)
CONFIG_IDF_TARGET="esp32"
CONFIG_FREERTOS_HZ=1000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Flash — 4 MB (standard ESP32 module)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Custom partition table (2 MB app for BT stack)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Bluetooth — Bluedroid Classic BT (Switch Pro Controller)
CONFIG_BT_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=n
CONFIG_BT_SSP_ENABLED=y
CONFIG_BT_SDP_COMMON_ENABLED=y
CONFIG_BT_HID_ENABLED=y
CONFIG_BT_HID_DEVICE_ENABLED=y
CONFIG_BT_SDP_PAD_LEN=1024
CONFIG_BT_SDP_ATTR_LEN=512

# Increase main task stack for BT callbacks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# GPIO layout from existing BluControl board wiring
CONFIG_BEBOPCORE_INPUT_ACTIVE_LOW=y
CONFIG_BEBOPCORE_GPIO_BTN_A=26
CONFIG_BEBOPCORE_GPIO_BTN_B=25
CONFIG_BEBOPCORE_GPIO_BTN_X=-1
CONFIG_BEBOPCORE_GPIO_BTN_Y=-1
CONFIG_BEBOPCORE_GPIO_BTN_DPAD_RIGHT=-1
CONFIG_BEBOPCORE_GPIO_BTN_DPAD_DOWN=-1
CONFIG_BEBOPCORE_GPIO_BTN_DPAD_LEFT=-1
CONFIG_BEBOPCORE_GPIO_BTN_DPAD_UP=-1
CONFIG_BEBOPCORE_GPIO_BTN_L=33
CONFIG_BEBOPCORE_GPIO_BTN_ZL=-1
CONFIG_BEBOPCORE_GPIO_BTN_R=32
CONFIG_BEBOPCORE_GPIO_BTN_ZR=-1
CONFIG_BEBOPCORE_GPIO_BTN_START=21
CONFIG_BEBOPCORE_GPIO_BTN_SELECT=19
CONFIG_BEBOPCORE_GPIO_BTN_HOME=-1
CONFIG_BEBOPCORE_GPIO_BTN_CAPTURE=-1
CONFIG_BEBOPCORE_GPIO_BTN_STICK_LEFT=-1
CONFIG_BEBOPCORE_GPIO_BTN_STICK_RIGHT=-1
CONFIG_BEBOPCORE_GPIO_BTN_SHIFT=18
CONFIG_BEBOPCORE_GPIO_BTN_PROTOCOL=23
CONFIG_BEBOPCORE_GPIO_LSTICK_X_POS=27
CONFIG_BEBOPCORE_GPIO_LSTICK_X_NEG=14
CONFIG_BEBOPCORE_GPIO_LSTICK_Y_POS=5
CONFIG_BEBOPCORE_GPIO_LSTICK_Y_NEG=13
CONFIG_BEBOPCORE_POWER_LED_GPIO=0
CONFIG_BEBOPCORE_LED_CONN_GPIO=15
CONFIG_BEBOPCORE_LED_PROTO_GPIO=4
